# .zsh_plugins.txt - antidote plugins file

# OMZ framework libs (needed by OMZ plugins below)
getantidote/use-omz
ohmyzsh/ohmyzsh path:lib

# OMZ plugins
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/gh
ohmyzsh/ohmyzsh path:plugins/ssh-agent

# Completions
zsh-users/zsh-completions kind:fpath path:src

# Fish-like features (standalone, deferred for perf)
zsh-users/zsh-autosuggestions kind:defer
zdharma-continuum/fast-syntax-highlighting kind:defer
